grevaillot/svd_tools/headers/STM32H7x7_CM7/bdma.h
#define BDMA_BDMA_CNDTR0_NDT_SHIFT		0
#define BDMA_BDMA_CNDTR0_NDT_MASK		0xffff
/** @defgroup bdma_bdma_cndtr0_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cpar0 BDMACPAR0 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CPAR0_PA_SHIFT		0
#define BDMA_BDMA_CPAR0_PA_MASK		0xffffffff
/** @defgroup bdma_bdma_cpar0_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cm0ar0 BDMACM0AR0 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CM0AR0_MA_SHIFT		0
#define BDMA_BDMA_CM0AR0_MA_MASK		0xffffffff
/** @defgroup bdma_bdma_cm0ar0_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cm1ar0 BDMACM1AR0 BDMA channel x memory 1 address register
@{*/


/**@}*/

/** @defgroup bdma_bdma_ccr1 BDMACCR1 DMA channel x configuration register
@{*/

/** BDMA_BDMA_CCR1_CT current target memory of DMA transfer in double-buffer mode **/
#define BDMA_BDMA_CCR1_CT		(1 << 16)
/** BDMA_BDMA_CCR1_DBM double-buffer mode **/
#define BDMA_BDMA_CCR1_DBM		(1 << 15)
/** BDMA_BDMA_CCR1_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_MEM2MEM		(1 << 14)

#define BDMA_BDMA_CCR1_PL_SHIFT		12
#define BDMA_BDMA_CCR1_PL_MASK		0x03
/** @defgroup bdma_bdma_ccr1_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_BDMA_CCR1_MSIZE_SHIFT		10
#define BDMA_BDMA_CCR1_MSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr1_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_BDMA_CCR1_PSIZE_SHIFT		8
#define BDMA_BDMA_CCR1_PSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr1_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA_BDMA_CCR1_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_MINC		(1 << 7)
/** BDMA_BDMA_CCR1_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_PINC		(1 << 6)
/** BDMA_BDMA_CCR1_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_CIRC		(1 << 5)
/** BDMA_BDMA_CCR1_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_DIR		(1 << 4)
/** BDMA_BDMA_CCR1_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_TEIE		(1 << 3)
/** BDMA_BDMA_CCR1_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_HTIE		(1 << 2)
/** BDMA_BDMA_CCR1_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_TCIE		(1 << 1)
/** BDMA_BDMA_CCR1_EN Channel enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_EN		(1 << 0)

/**@}*/

/** @defgroup bdma_bdma_cndtr1 BDMACNDTR1 DMA channel x number of data register
@{*/


#define BDMA_BDMA_CNDTR1_NDT_SHIFT		0
#define BDMA_BDMA_CNDTR1_NDT_MASK		0xffff
/** @defgroup bdma_bdma_cndtr1_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cpar1 BDMACPAR1 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CPAR1_PA_SHIFT		0
#define BDMA_BDMA_CPAR1_PA_MASK		0xffffffff
/** @defgroup bdma_bdma_cpar1_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cm0ar1 BDMACM0AR1 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CM0AR1_MA_SHIFT		0
#define BDMA_BDMA_CM0AR1_MA_MASK		0xffffffff
/** @defgroup bdma_bdma_cm0ar1_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cm1ar1 BDMACM1AR1 BDMA channel x memory 1 address register
@{*/


/**@}*/

