grevaillot/svd_tools/headers/STM32H7x7_CM7/bdma.h
#define BDMA_BDMA_CCR5_PSIZE_SHIFT		8
#define BDMA_BDMA_CCR5_PSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr5_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA_BDMA_CCR5_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR5_MINC		(1 << 7)
/** BDMA_BDMA_CCR5_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR5_PINC		(1 << 6)
/** BDMA_BDMA_CCR5_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR5_CIRC		(1 << 5)
/** BDMA_BDMA_CCR5_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR5_DIR		(1 << 4)
/** BDMA_BDMA_CCR5_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR5_TEIE		(1 << 3)
/** BDMA_BDMA_CCR5_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR5_HTIE		(1 << 2)
/** BDMA_BDMA_CCR5_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR5_TCIE		(1 << 1)
/** BDMA_BDMA_CCR5_EN Channel enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR5_EN		(1 << 0)

/**@}*/

/** @defgroup bdma_bdma_cndtr5 BDMACNDTR5 DMA channel x number of data register
@{*/


#define BDMA_BDMA_CNDTR5_NDT_SHIFT		0
#define BDMA_BDMA_CNDTR5_NDT_MASK		0xffff
/** @defgroup bdma_bdma_cndtr5_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cpar5 BDMACPAR5 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CPAR5_PA_SHIFT		0
#define BDMA_BDMA_CPAR5_PA_MASK		0xffffffff
/** @defgroup bdma_bdma_cpar5_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cm0ar5 BDMACM0AR5 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CM0AR5_MA_SHIFT		0
#define BDMA_BDMA_CM0AR5_MA_MASK		0xffffffff
/** @defgroup bdma_bdma_cm0ar5_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cm1ar5 BDMACM1AR5 BDMA channel x memory 1 address register
@{*/


/**@}*/

/** @defgroup bdma_bdma_ccr6 BDMACCR6 DMA channel x configuration register
@{*/

/** BDMA_BDMA_CCR6_CT current target memory of DMA transfer in double-buffer mode **/
#define BDMA_BDMA_CCR6_CT		(1 << 16)
/** BDMA_BDMA_CCR6_DBM double-buffer mode **/
#define BDMA_BDMA_CCR6_DBM		(1 << 15)
/** BDMA_BDMA_CCR6_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_MEM2MEM		(1 << 14)

#define BDMA_BDMA_CCR6_PL_SHIFT		12
#define BDMA_BDMA_CCR6_PL_MASK		0x03
/** @defgroup bdma_bdma_ccr6_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_BDMA_CCR6_MSIZE_SHIFT		10
#define BDMA_BDMA_CCR6_MSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr6_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_BDMA_CCR6_PSIZE_SHIFT		8
#define BDMA_BDMA_CCR6_PSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr6_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA_BDMA_CCR6_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_MINC		(1 << 7)
/** BDMA_BDMA_CCR6_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_PINC		(1 << 6)
/** BDMA_BDMA_CCR6_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_CIRC		(1 << 5)
/** BDMA_BDMA_CCR6_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_DIR		(1 << 4)
/** BDMA_BDMA_CCR6_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_TEIE		(1 << 3)
/** BDMA_BDMA_CCR6_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_HTIE		(1 << 2)
/** BDMA_BDMA_CCR6_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_TCIE		(1 << 1)
/** BDMA_BDMA_CCR6_EN Channel enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR6_EN		(1 << 0)

/**@}*/

/** @defgroup bdma_bdma_cndtr6 BDMACNDTR6 DMA channel x number of data register
@{*/


#define BDMA_BDMA_CNDTR6_NDT_SHIFT		0
#define BDMA_BDMA_CNDTR6_NDT_MASK		0xffff
/** @defgroup bdma_bdma_cndtr6_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cpar6 BDMACPAR6 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CPAR6_PA_SHIFT		0
#define BDMA_BDMA_CPAR6_PA_MASK		0xffffffff
/** @defgroup bdma_bdma_cpar6_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

